{
  "nodes": [
    {
      "id": 0,
      "text": "Statistical physics applied to monetary transactions explains the observed distribution of money and income: conservation of money in agent transactions plus statistical dynamics lead to an exponential stationary distribution for money and, with additional multiplicative effects, to a two-class distribution with a power-law upper tail; this framework clarifies origins of inequality, role of entropy, and systemic effects of debt, banks, and state money.",
      "role": "Hypothesis",
      "parents": null,
      "children": [
        1,
        2,
        3,
        4,
        5,
        6
      ]
    },
    {
      "id": 1,
      "text": "Method: Using kinetic theory the Boltzmann equation for pairwise money transfers and its small-step limit, the Fokker-Planck (Kolmogorov forward) equation, to model time evolution of money distribution P(m,t) with transfer kernel f and moments A and B.",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        2,
        7
      ]
    },
    {
      "id": 2,
      "text": "Claim: If money is conserved in transactions and microscopic transaction rules satisfy time-reversal symmetry (or transfers are additive), the stationary solution of the kinetic equation is exponential P(m) proportional to exp(-m/Tm) with Tm = M/N.",
      "role": "Claim",
      "parents": [
        0,
        1
      ],
      "children": [
        3,
        8
      ]
    },
    {
      "id": 3,
      "text": "Evidence/Result: Agent-based simulations starting from equal money balances evolve to a stationary exponential money distribution P(m) due to entropy increase and boundary condition m>0; perfect equality is unstable.",
      "role": "Evidence",
      "parents": [
        1,
        2
      ],
      "children": [
        4
      ]
    },
    {
      "id": 4,
      "text": "Claim/Result: Empirical income data (US Census, IRS) show a two-class structure: the majority follows an exponential distribution (lower class) while the high-income tail follows a Pareto power law (upper class); aggregate income distribution decomposes into exponential plus power-law.",
      "role": "Result",
      "parents": [
        0,
        3
      ],
      "children": [
        9,
        11
      ]
    },
    {
      "id": 5,
      "text": "Claim: The exponential distribution follows from maximal entropy under fixed total money (analogous to Boltzmann) and entropy increases monotonically under the kinetic dynamics, making inequality an entropic consequence even among statistically identical agents.",
      "role": "Claim",
      "parents": [
        0,
        2
      ],
      "children": [
        3,
        4
      ]
    },
    {
      "id": 6,
      "text": "Claim: Money and physical goods are distinct layers: money is an informational accounting tool conserved in peer-to-peer transactions, while goods are physical and nonconserved; failure to distinguish layers causes common fallacies about money creation by production or investment.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        7,
        8,
        10
      ]
    },
    {
      "id": 7,
      "text": "Claim/Method: Time-reversal symmetry of microscopic transfer probabilities f[m,m']→[m-Δ,m'+Δ] is sufficient (though not necessary) for the product form P(m)P(m')=P(m-Δ)P(m'+Δ) and hence exponential stationary distribution; multiplicative (percent) transfer rules break that symmetry and yield Gamma-like or non-exponential distributions.",
      "role": "Claim",
      "parents": [
        1,
        6
      ],
      "children": [
        2,
        3
      ]
    },
    {
      "id": 8,
      "text": "Claim: Kinetic models should distinguish money versus wealth transfer—wealth includes prices and physical volumes and is not conserved in transactions; modeling conservative transfers as wealth transfer is conceptually misleading because wealth changes between transactions via price or production changes.",
      "role": "Claim",
      "parents": [
        6,
        2
      ],
      "children": null
    },
    {
      "id": 9,
      "text": "Evidence: IRS income-series analysis 1983–2013 shows temporal evolution of exponential lower class temperature T and power-law tail exponent alpha, with fraction f of income going to the top class spiking during speculative episodes (.com, housing) and after Quantitative Easing, consistent with increased inequality concentrated in upper tail.",
      "role": "Evidence",
      "parents": [
        4
      ],
      "children": [
        11
      ]
    },
    {
      "id": 10,
      "text": "Claim: Debt is a promissory third layer distinct from money; borrowing creates paired money and debt obligations (particle-antiparticle analogy) leaving net worth unchanged, but it removes the boundary that stabilizes money distribution and enables unbounded negative balances unless constrained.",
      "role": "Claim",
      "parents": [
        6
      ],
      "children": [
        12,
        13
      ]
    },
    {
      "id": 11,
      "text": "Conclusion: Central bank interventions that inject newly created (exogenous) money into the system—e.g., monetization of government debt or quantitative easing—tend to direct liquidity toward financial institutions and the upper class, thereby increasing income/wealth inequality as seen empirically.",
      "role": "Conclusion",
      "parents": [
        9,
        5
      ],
      "children": [
        14
      ]
    },
    {
      "id": 12,
      "text": "Claim/Evidence: Without debt limits, simulation and theoretical reasoning show net-worth distribution broadens without bound, entropy increases without saturation, and debt accumulation is statistically irreversible; interest accrual amplifies divergence rather than stabilizing it.",
      "role": "Evidence",
      "parents": [
        10
      ],
      "children": [
        13
      ]
    },
    {
      "id": 13,
      "text": "Claim: Commercial banks do not create net, unconditional money for the economy but create debt and augment deposit balances via lending; reserves at the central bank remain subject to conservation, and large-scale endogenous debt expansion requires eventual central-bank monetization to prevent collapse.",
      "role": "Claim",
      "parents": [
        10,
        12
      ],
      "children": [
        11,
        14
      ]
    },
    {
      "id": 14,
      "text": "Conclusion: The ultimate source of aggregate capitalist monetary profit and sustainability of broad nominal growth is injections of exogenous state money (monetization, bailouts), so capitalist profit at scale depends on state monetary action rather than purely private transactions.",
      "role": "Conclusion",
      "parents": [
        11,
        13
      ],
      "children": null
    }
  ]
}