{
  "nodes": [
    {
      "id": 0,
      "text": "Major infrastructure projects systematically exhibit biased ex ante forecasts (underestimated costs, overestimated benefits) that cause poor outcomes and require methodological and governance reforms to avoid 'survival of the un-fittest'.",
      "role": "Hypothesis",
      "parents": null,
      "children": [
        1,
        2,
        3,
        4,
        5,
        7,
        8,
        10,
        11,
        12,
        15
      ]
    },
    {
      "id": 1,
      "text": "Characteristics of major infrastructure projects: long planning horizons, complex interfaces, non-standard technology, multi-actor decision making, early lock-in of concepts, changing scope, and unaccounted unplanned events.",
      "role": "Context",
      "parents": [
        0
      ],
      "children": [
        2,
        3
      ]
    },
    {
      "id": 2,
      "text": "Empirical evidence (Table 1): cost overruns are widespread across 258 transportation projects; average overruns: rail 44.7%, bridges/tunnels 33.8%, roads 20.4%; 9 out of 10 projects have overruns; overruns persistent over 70 years.",
      "role": "Evidence",
      "parents": [
        0,
        1
      ],
      "children": [
        4,
        5,
        7,
        12,
        13
      ]
    },
    {
      "id": 3,
      "text": "Empirical evidence (Table 2): demand forecast inaccuracies across 208 projects; rail passenger traffic on average 51.4% lower than forecast, road traffic on average 9.5% higher; rail forecasts biased high; forecasting accuracy unchanged over 30 years.",
      "role": "Evidence",
      "parents": [
        0,
        1
      ],
      "children": [
        4,
        5,
        7
      ]
    },
    {
      "id": 4,
      "text": "Because cost and demand forecasts are biased and highly uncertain, conventional ex ante cost-benefit analysis for major infrastructure projects is systematically misleading and cannot be trusted alone.",
      "role": "Claim",
      "parents": [
        0,
        2,
        3
      ],
      "children": [
        10,
        11,
        14
      ]
    },
    {
      "id": 5,
      "text": "Three explanatory families for forecasting inaccuracy: technical errors, psychological optimism bias, and political-economic strategic misrepresentation; empirical data reject technical error as main cause and do not support optimism bias as sole cause.",
      "role": "Claim",
      "parents": [
        0,
        2,
        3
      ],
      "children": [
        6,
        7
      ]
    },
    {
      "id": 6,
      "text": "Political-economic explanation supported: interviews and case studies (UK and US) show promoters and planners strategically underestimate costs and overestimate benefits to secure funding; incentives make such misrepresentation rational.",
      "role": "Evidence",
      "parents": [
        5,
        2,
        3
      ],
      "children": [
        7
      ]
    },
    {
      "id": 7,
      "text": "Mechanism 'survival of the un-fittest': projects that look best on paper (via underestimated costs and overstated benefits) are selected and subsequently experience the largest cost overruns and benefit shortfalls.",
      "role": "Claim",
      "parents": [
        0,
        6,
        2,
        3
      ],
      "children": [
        12,
        14
      ]
    },
    {
      "id": 8,
      "text": "Method: reference class forecasting (outside view) - steps: (1) identify relevant reference class of past projects, (2) establish probability distribution for that class from empirical data, (3) compare specific project to distribution and adjust forecasts accordingly.",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        9,
        10,
        14
      ]
    },
    {
      "id": 9,
      "text": "Result: reference class forecasting produces more accurate, less biased forecasts in practice (examples: Edinburgh Tram cost uplift from 320M to 400M; Crossrail and others have applied the method).",
      "role": "Result",
      "parents": [
        8,
        2,
        3
      ],
      "children": [
        14
      ]
    },
    {
      "id": 10,
      "text": "Governance recommendation A - transparency and public control: shift appraisal away from promoters, independent peer review, benchmarking, public disclosure, public hearings, professional scrutiny, reconsider projects with inflated BCRs, and enforce professional/criminal penalties for deception.",
      "role": "Method",
      "parents": [
        0,
        4,
        8
      ],
      "children": [
        14
      ]
    },
    {
      "id": 11,
      "text": "Governance recommendation B - competition and market control: require meaningful private finance participation without sovereign guarantees, make forecasters share financial responsibility for misrepresentation, consolidate project organizations and strengthen contract-writing, and use market due diligence.",
      "role": "Method",
      "parents": [
        0,
        4,
        8
      ],
      "children": [
        14
      ]
    },
    {
      "id": 12,
      "text": "Current trends increasing risk: large stimulus-driven spending, geographic shift to emerging economies, and rapid increase in ICT content in projects amplify financial and delivery risks for infrastructure.",
      "role": "Claim",
      "parents": [
        0,
        2,
        3,
        7
      ],
      "children": [
        13,
        14
      ]
    },
    {
      "id": 13,
      "text": "Supporting evidence for trend risks: higher average overruns in emerging economies (rail 64.6% vs North America 40.8% and Europe 34.2%), and ICT-enabled project failures (examples: Toll Collect, Hong Kong airport, Heathrow Terminal 5) cause large delays and economic harm.",
      "role": "Evidence",
      "parents": [
        12,
        2,
        3
      ],
      "children": [
        14
      ]
    },
    {
      "id": 14,
      "text": "Conclusion: to prevent wasteful 'survival of the un-fittest' and reduce catastrophic risks, planners must combine outside-view methods (reference class forecasting) with stronger governance and accountability; otherwise stimulus and current trends will exacerbate disasters.",
      "role": "Conclusion",
      "parents": [
        4,
        7,
        8,
        9,
        10,
        11,
        12,
        13
      ],
      "children": null
    },
    {
      "id": 15,
      "text": "Limitation/assumption: primary empirical data come from transportation projects (largest available datasets) but comparative work indicates similar problems apply to many other project types (ICT, buildings, energy, mega-events, etc.).",
      "role": "Limitation",
      "parents": [
        0,
        2,
        3
      ],
      "children": [
        14
      ]
    }
  ]
}