{
  "nodes": [
    {
      "id": 0,
      "text": "Has intergenerational income mobility in the United States declined for children born 1971–1993, or does the United States remain a land of opportunity?",
      "role": "Hypothesis",
      "parents": null,
      "children": [
        1,
        2,
        3,
        11,
        12,
        15
      ]
    },
    {
      "id": 1,
      "text": "Method: Construct linked parent-child samples using administrative tax records: a population-based sample for 1980–1993 cohorts (claimed dependents, 1996–2012) and an SOI stratified cross-section sample for 1971–1982 cohorts; link rates ~95% (population) and coverage ~88% (SOI).",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        6,
        7,
        9,
        13
      ]
    },
    {
      "id": 2,
      "text": "Method / Variable definitions: define parent and child family income from tax records (real 2012 dollars), parent income measured at child ages 15–19 (population) or single year (SOI); child income at ages 26 and 29–30; college attendance = 1098-T at age 19; rank-rank regressions and college-attendance gradients used to measure mobility.",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        6,
        7,
        8,
        13
      ]
    },
    {
      "id": 3,
      "text": "Claim / Conceptual decomposition: decompose joint parent-child income distribution into (i) the copula (joint distribution of ranks) which determines rank-based mobility, and (ii) the marginal distributions which determine inequality within generations.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        4,
        5,
        11,
        14
      ]
    },
    {
      "id": 4,
      "text": "Result / Claim: The copula (rank-based relationship between parent and child incomes) has not changed over time; children's chances of moving up or down the income distribution have remained stable across cohorts.",
      "role": "Result",
      "parents": [
        3,
        0
      ],
      "children": [
        6,
        7,
        10,
        11,
        15
      ]
    },
    {
      "id": 5,
      "text": "Result / Evidence: The marginal distributions of income for parents and children have widened substantially over time; measured inequality (Gini, top 1 percent shares) increased in the sample.",
      "role": "Result",
      "parents": [
        3,
        0
      ],
      "children": [
        11,
        15
      ]
    },
    {
      "id": 6,
      "text": "Evidence: Rank-rank slopes estimated in the SOI sample for 1971–1982 cohorts are approximately 0.30 (s.e. < 0.01) and show no trend; rank-rank relationship is nearly linear and robust to age and measurement choices.",
      "role": "Evidence",
      "parents": [
        1,
        2,
        4
      ],
      "children": [
        10,
        15
      ]
    },
    {
      "id": 7,
      "text": "Evidence: Population-based sample estimates using child income at age 26 for 1980–1986 cohorts show no trend in rank-rank slopes; age 26 and age 30 measures are highly correlated across areas, supporting use of age 26 for recent cohorts.",
      "role": "Evidence",
      "parents": [
        1,
        2,
        4
      ],
      "children": [
        10,
        13,
        15
      ]
    },
    {
      "id": 8,
      "text": "Result / Evidence: College attendance gradient (gap in college attendance between lowest- and highest-income parents) is essentially constant ~74.5% for 1984–1989 cohorts and declines slightly to 69.2% for the 1993 cohort; college attendance strongly predicts earnings and is a proxy for mobility for younger cohorts.",
      "role": "Result",
      "parents": [
        2,
        4
      ],
      "children": [
        10,
        13,
        15
      ]
    },
    {
      "id": 9,
      "text": "Evidence: Quintile transition probabilities are stable across cohorts; probability of a child reaching the top quintile from the bottom quintile is about 8.4% in 1971 and 9% in 1986 (child income at age 26), showing little change.",
      "role": "Evidence",
      "parents": [
        1,
        2
      ],
      "children": [
        15
      ]
    },
    {
      "id": 10,
      "text": "Result: Consolidated series combining age 29–30 income gradients, rescaled age 26 gradients, and rescaled college gradients yields an estimated trend slope of −0.0006 per year for 1971–1993 cohorts, effectively a flat series with small upper bound on change.",
      "role": "Result",
      "parents": [
        6,
        7,
        8,
        13,
        0
      ],
      "children": [
        15
      ]
    },
    {
      "id": 11,
      "text": "Claim / Interpretation: Because inequality (marginals) increased while rank-based mobility (copula) stayed constant, the consequences of the birth lottery (parental income determining level differences) are larger today even if relative mobility is unchanged.",
      "role": "Claim",
      "parents": [
        4,
        5,
        0,
        3
      ],
      "children": [
        15,
        14
      ]
    },
    {
      "id": 12,
      "text": "Result / Claim: Large and persistent regional differences in mobility exist across US areas (e.g., bottom-to-top probabilities from ~4% in some Southeast areas to over 12% in Mountain states); these spatial patterns are stable over cohorts though some modest differential trends occur.",
      "role": "Result",
      "parents": [
        1,
        2,
        4,
        0
      ],
      "children": [
        15
      ]
    },
    {
      "id": 13,
      "text": "Method / Evidence: Construct consolidated mobility series by scaling age 26 income gradients by 1.12 to match age 29–30 levels and scaling college gradients by 0.40 to match rescaled age 26 gradients for overlap cohorts; forecasts for recent cohorts assume constant multiples.",
      "role": "Method",
      "parents": [
        1,
        2
      ],
      "children": [
        10
      ]
    },
    {
      "id": 14,
      "text": "Assumption / Caveat: The measured trend in mobility depends on the chosen definition of mobility (rank-based versus level-based measures); different normative objectives yield different conclusions (e.g., fixed dollar thresholds vs relative ranks).",
      "role": "Assumption",
      "parents": [
        3,
        11,
        0
      ],
      "children": [
        15
      ]
    },
    {
      "id": 15,
      "text": "Conclusion: Rank-based intergenerational mobility in the United States remained largely stable for children born 1971–1993, but rising inequality increased absolute income gaps across generations and substantial, persistent regional variation suggests some areas offer much less opportunity.",
      "role": "Conclusion",
      "parents": [
        4,
        5,
        6,
        7,
        8,
        9,
        11,
        12,
        14,
        10,
        0
      ],
      "children": null
    }
  ]
}