{
  "nodes": [
    {
      "id": 0,
      "text": "Do intergenerational income mobility and its determinants in the United States change across birth cohorts from 1971 to 1993?",
      "role": "Hypothesis",
      "parents": null,
      "children": [
        1,
        2,
        3,
        4,
        12
      ]
    },
    {
      "id": 1,
      "text": "We construct samples from linked administrative tax records: a population-based sample for 1980–1993 cohorts (1996–2012 tax records, ~95% link rate) and an SOI stratified sample for 1971–1982 cohorts (1987–1998 cross sections, ~0.1% returns, weighted to represent cohorts).",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        6,
        7,
        8,
        9,
        12,
        15
      ]
    },
    {
      "id": 2,
      "text": "Key variable definitions: parent and child family income (real 2012 dollars) from tax and information returns, parent income averaged ages 15–19 in population sample or single year in SOI; child income measured at ages 26 and 29–30; college attendance indicated by 1098-T at age 19.",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        6,
        8,
        9
      ]
    },
    {
      "id": 3,
      "text": "Analytic framework decomposes joint parent-child income distribution into the copula (joint ranks) and marginal distributions (within-generation inequality); some mobility measures depend only on the copula while others mix copula and marginals.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        4,
        5,
        10
      ]
    },
    {
      "id": 4,
      "text": "Rank-based intergenerational mobility (the copula) can be summarized by the rank-rank slope: regression of child percentile rank on parent percentile rank within birth cohorts.",
      "role": "Claim",
      "parents": [
        3
      ],
      "children": [
        6,
        7
      ]
    },
    {
      "id": 5,
      "text": "Marginal distributions (inequality) determine absolute income differences across generations and can change independently from rank-based mobility.",
      "role": "Claim",
      "parents": [
        3
      ],
      "children": [
        7,
        14
      ]
    },
    {
      "id": 6,
      "text": "Empirical rank-rank slopes for 1971–1974, 1975–1978, and 1979–1982 cohorts in the SOI sample are approximately 0.299, 0.291, and 0.313 respectively (standard errors < 0.01), indicating a nearly linear and stable relationship.",
      "role": "Evidence",
      "parents": [
        1,
        2,
        4
      ],
      "children": [
        7,
        14
      ]
    },
    {
      "id": 7,
      "text": "Using age-26 income in the population sample for 1980–1986 cohorts yields rank-rank slopes with no trend and more precise estimates; age-26 and age-30 measures are highly correlated across areas.",
      "role": "Evidence",
      "parents": [
        1,
        2,
        4
      ],
      "children": [
        11,
        14
      ]
    },
    {
      "id": 8,
      "text": "For 1984–1993 cohorts, the college attendance gradient (regressing college indicator at age 19 on parent income rank) is roughly constant: gap about 74.5% for 1984–1989 cohorts, falling to 69.2% for 1993 cohort; college attendance strongly predicts earnings.",
      "role": "Evidence",
      "parents": [
        1,
        2
      ],
      "children": [
        11,
        14
      ]
    },
    {
      "id": 9,
      "text": "Quintile transition probabilities (e.g., probability a child from bottom parental quintile reaches top child quintile measured at age 26) show little trend: example 8.4% in 1971 versus 9.0% in 1986.",
      "role": "Evidence",
      "parents": [
        1,
        2
      ],
      "children": [
        11,
        14
      ]
    },
    {
      "id": 10,
      "text": "Because copula remained stable while marginals widened, different mobility definitions give different conclusions: rank-based mobility is stable, but mobility measured by reaching fixed absolute income thresholds can rise, and inequality amplifies expected income gaps by parent rank.",
      "role": "Claim",
      "parents": [
        3,
        5
      ],
      "children": [
        11,
        14
      ]
    },
    {
      "id": 11,
      "text": "We create a consolidated mobility series for 1971–1993 by combining age-29–30 rank slopes, age-26 slopes (scaled by 1.12), and college gradients (scaled by 0.40) to forecast age-30 mobility for recent cohorts under constant-scaling assumptions.",
      "role": "Method",
      "parents": [
        1,
        2,
        8
      ],
      "children": [
        12,
        13
      ]
    },
    {
      "id": 12,
      "text": "Regional variation in mobility is large and persistent: age-26 rank-rank slopes and college gradients are consistently lower in Mountain and Pacific states and higher in parts of the Southeast, with New England intermediate.",
      "role": "Claim",
      "parents": [
        0,
        1
      ],
      "children": [
        13,
        14
      ]
    },
    {
      "id": 13,
      "text": "Specific regional evidence: for 1980–1985 cohorts, bottom-to-top probability is as low as 4% in parts of the Southeast and over 12% in some Mountain-state regions; some divisions show modest differential cohort trends.",
      "role": "Evidence",
      "parents": [
        12,
        1
      ],
      "children": [
        14
      ]
    },
    {
      "id": 14,
      "text": "Conclusion: Rank-based intergenerational mobility in the United States remained essentially stable from 1971 to 1993; children entering the labor market recently have similar relative chances of upward mobility as those born in the 1970s, even as inequality increased.",
      "role": "Conclusion",
      "parents": [
        6,
        7,
        8,
        9,
        10,
        13
      ],
      "children": null
    },
    {
      "id": 15,
      "text": "Limitation: data endpoint 2012 prevents observing age-30 incomes for cohorts born after 1982, requiring use of age-26 and college attendance proxies plus scaling assumptions to forecast age-30 mobility for recent cohorts.",
      "role": "Limitation",
      "parents": [
        1
      ],
      "children": [
        11,
        14
      ]
    }
  ]
}