{
  "nodes": [
    {
      "id": 0,
      "text": "Increasing sleep among the urban poor will improve economic outcomes (productivity, cognition, well-being, and decision making).",
      "role": "Hypothesis",
      "parents": null,
      "children": [
        1,
        2,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14
      ]
    },
    {
      "id": 1,
      "text": "Urban poor adults in Chennai are severely sleep-deprived compared to expert recommendations and appear to have low sleep quality.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        3
      ]
    },
    {
      "id": 2,
      "text": "We measured sleep objectively using wrist actigraphy and implemented a randomized controlled trial (RCT) with rich outcome measurement.",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        3,
        4
      ]
    },
    {
      "id": 3,
      "text": "Baseline evidence (actigraphy): average night sleep ≈5.5 hours, time in bed ≈8 hours, sleep efficiency ≈70%, ≈31 awakenings per night; self-reports overestimate sleep.",
      "role": "Evidence",
      "parents": [
        1,
        2
      ],
      "children": [
        5,
        6,
        10
      ]
    },
    {
      "id": 4,
      "text": "RCT interventions: two night-sleep bundles (devices + encouragement; devices + financial incentives) and a cross-randomized workplace half-hour nap opportunity; participants worked a month-long paid data-entry job with detailed outcome collection.",
      "role": "Method",
      "parents": [
        2
      ],
      "children": [
        5,
        6,
        11
      ]
    },
    {
      "id": 5,
      "text": "Night-sleep interventions increased nighttime sleep by 27 minutes on average (larger for incentives), driven entirely by increased time in bed (~38 minutes) with no significant change in sleep efficiency.",
      "role": "Result",
      "parents": [
        4,
        3
      ],
      "children": [
        7,
        10
      ]
    },
    {
      "id": 6,
      "text": "The nap intervention increased daytime (workplace) sleep by about 14 minutes on average, with higher measured nap sleep efficiency and fewer awakenings during naps in the office environment.",
      "role": "Result",
      "parents": [
        4,
        3
      ],
      "children": [
        8,
        10
      ]
    },
    {
      "id": 7,
      "text": "Pooled night-sleep increases had no detectable positive effects on overall index, cognition, productivity, decision making, preferences, or well-being, and they reduced labor supply by about nine minutes per day leading to small decreases in earnings.",
      "role": "Result",
      "parents": [
        5,
        3
      ],
      "children": [
        9,
        12,
        13
      ]
    },
    {
      "id": 8,
      "text": "Naps increased the overall summary index by 0.12 standard deviations and yielded significant improvements in productivity, psychological well-being, lab measures of cognition and attention at work, while reducing work time during the nap period.",
      "role": "Result",
      "parents": [
        6,
        3
      ],
      "children": [
        13
      ]
    },
    {
      "id": 9,
      "text": "Surveyed experts (sleep science and economics) predicted sizable economic benefits (median predicted ~7% increase in output for +30 minutes night sleep), predictions that the RCT results rejected.",
      "role": "Evidence",
      "parents": [
        7
      ],
      "children": null
    },
    {
      "id": 10,
      "text": "Low sleep efficiency in this population implies high opportunity costs: increasing one minute of actual sleep required substantially more (empirically ≈1.4) minutes in bed, limiting available time for work/leisure.",
      "role": "Claim",
      "parents": [
        3,
        5,
        6
      ],
      "children": [
        7,
        13
      ]
    },
    {
      "id": 11,
      "text": "Key outcomes and measurements: daily actigraphy (night and nap sleep metrics), precise labor-supply and productivity from the data-entry platform, earnings, lab cognitive tasks (PVT, memory, inhibitory control), well-being surveys, and experimental measures of preferences and savings.",
      "role": "Method",
      "parents": [
        4
      ],
      "children": [
        7,
        8
      ]
    },
    {
      "id": 12,
      "text": "Possible explanations for null nighttime-sleep benefits include (a) marginal, policy-relevant increases differ from severe lab-induced deprivation experiments; (b) poor sleep quality (low efficiency, frequent awakenings) reduces marginal returns; and (c) timing of sleep matters so naps and night sleep are not perfect substitutes.",
      "role": "Claim",
      "parents": [
        7,
        8,
        3
      ],
      "children": [
        13,
        14
      ]
    },
    {
      "id": 13,
      "text": "Conclusion and policy-relevant claim: In this urban poor Chennai setting, increasing nighttime sleep via modest interventions yields low short-run economic returns and notable opportunity costs, while workplace naps produce measurable benefits; policymakers should not uncritically extrapolate lab results or expert priors and should consider preserving or enabling naps in workplaces.",
      "role": "Conclusion",
      "parents": [
        7,
        8,
        12,
        10
      ],
      "children": null
    },
    {
      "id": 14,
      "text": "Limitations: three-week treatment window for many outcomes, generalizability concerns beyond the specific sample and job context, limited ability to disentangle timing versus quality effects, and possible longer-term health effects not captured.",
      "role": "Limitation",
      "parents": [
        2,
        3,
        12
      ],
      "children": [
        13
      ]
    }
  ]
}