{
  "nodes": [
    {
      "id": 0,
      "text": "When and why are the gains from cooperative specialization realized better within a firm (centralized contractual organization) rather than across decentralized markets, and what contractual structure characterizes the firm?",
      "role": "Hypothesis",
      "parents": null,
      "children": [
        1,
        2,
        3,
        4
      ]
    },
    {
      "id": 1,
      "text": "An economic organization must meter input productivity and apportion rewards in accord with productivity; poor metering lowers productivity while good metering raises it.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        5,
        6
      ]
    },
    {
      "id": 2,
      "text": "Team production uses multiple inputs whose joint output is not separable into individual contributions, making the marginal product of each input hard and costly to observe.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        5,
        7
      ]
    },
    {
      "id": 3,
      "text": "The firm is not characterized by authoritarian fiat but by a centralized contractual agent who is common to all input contracts and who economizes on costly metering of individual contributions.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        8,
        9
      ]
    },
    {
      "id": 4,
      "text": "The contractual structure defining the classical firm bundles rights: residual claimant, observe input behavior, be common party to contracts, unilaterally alter membership or contracts, and sell these rights.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        8,
        9
      ]
    },
    {
      "id": 5,
      "text": "When individual contribution is hard to detect, market exchange yields high metering costs and higher incentives to shirk; reducing shirking requires monitoring activities that themselves have costs.",
      "role": "Claim",
      "parents": [
        1,
        2
      ],
      "children": [
        6,
        7
      ]
    },
    {
      "id": 6,
      "text": "Because monitoring is costly, each team member equates realized private incentives not true social marginal rates, resulting in more leisure and less effort (viable shirking) than in costless monitoring world.",
      "role": "Result",
      "parents": [
        1,
        5
      ],
      "children": [
        10
      ]
    },
    {
      "id": 7,
      "text": "Market competition can discipline teams by replacing shirking members, but is imperfect because detection of shirking is costly and entrants still bear only part of the shirker's impact on output.",
      "role": "Claim",
      "parents": [
        2,
        5
      ],
      "children": [
        8
      ]
    },
    {
      "id": 8,
      "text": "Specialization of monitoring plus granting the monitor residual claimant rights reduces shirking more cheaply than decentralized market contracts and thereby motivates the emergence of the firm.",
      "role": "Conclusion",
      "parents": [
        3,
        4,
        7
      ],
      "children": [
        9,
        11
      ]
    },
    {
      "id": 9,
      "text": "The monitor's bundle of rights (residual, contract revision, central contracting party) enables unilateral disciplinary and membership changes that economize detection and enforcement costs in team production.",
      "role": "Claim",
      "parents": [
        4,
        8
      ],
      "children": [
        11
      ]
    },
    {
      "id": 10,
      "text": "Empirical and illustrative examples support the theory: farmer output sold in markets, lumbermill-cabinetmaker relations, university perquisites, and sports teams illustrate metering and monitoring issues.",
      "role": "Evidence",
      "parents": [
        6
      ],
      "children": [
        11
      ]
    },
    {
      "id": 11,
      "text": "Different organizational forms follow from informational and metering costs: profit-sharing and partnerships suit small teams or artistic/professional production; corporations, nonprofits, socialist firms, unions, and cooperatives arise from specific incentive and political constraints.",
      "role": "Claim",
      "parents": [
        8,
        9,
        10
      ],
      "children": [
        12,
        13,
        14
      ]
    },
    {
      "id": 12,
      "text": "Profit sharing is effective for small teams where reciprocal monitoring is feasible; large-scale profit sharing increases monitor shirking and is less viable without additional controls.",
      "role": "Result",
      "parents": [
        11
      ],
      "children": null
    },
    {
      "id": 13,
      "text": "Corporations address delegated monitoring problems by transferring decision authority to managers, relying on saleable shares, proxy battles, and market capitalization to discipline managers despite dispersed ownership.",
      "role": "Claim",
      "parents": [
        11
      ],
      "children": null
    },
    {
      "id": 14,
      "text": "Socialist or employee-residual-sharing firms tend to develop additional governance devices (e.g., worker committees) to limit manager shirking because general residual sharing weakens monitor incentives.",
      "role": "Claim",
      "parents": [
        11
      ],
      "children": null
    },
    {
      "id": 15,
      "text": "Firms act as specialized private markets that collect, collate, and sell information about heterogeneous inputs, enabling superior internal recombinations and promotions instead of external hires.",
      "role": "Conclusion",
      "parents": [
        8,
        11
      ],
      "children": [
        16
      ]
    },
    {
      "id": 16,
      "text": "Inputs whose user costs or depreciation are hard to detect when rented (portable tools, trucks, specialized equipment) tend to be owned by the residual-claimant firm rather than rented, reducing monitoring costs.",
      "role": "Claim",
      "parents": [
        15
      ],
      "children": null
    },
    {
      "id": 17,
      "text": "Limitations and assumptions: analysis assumes nonpecuniary utility components, focuses on information and metering costs as primary drivers, and does not model dynamic risk-distribution as the main rationale for firm existence.",
      "role": "Limitation",
      "parents": [
        0
      ],
      "children": null
    }
  ]
}