{
  "nodes": [
    {
      "id": 0,
      "text": "Ergodicity economics (EE) improves traditional finance by removing the ergodic axiom and explaining decisions and asset behavior through growth dynamics that distinguish ensemble averages (arithmetic mean) from time averages (geometric mean).",
      "role": "Hypothesis",
      "parents": null,
      "children": [
        1,
        2,
        3,
        4
      ]
    },
    {
      "id": 1,
      "text": "The ergodic axiom in traditional economics assumes time averages equal ensemble averages, an assumption imported from closed-system physics that is inappropriate for open, growing economic systems.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        5,
        6
      ]
    },
    {
      "id": 2,
      "text": "Non-ergodic growth dynamics cause the arithmetic mean (ensemble average) to overstate the geometric mean (time average), creating divergences between average outcomes across parallel realizations and the typical single-trajectory outcome.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        7,
        8
      ]
    },
    {
      "id": 3,
      "text": "EE provides a first-order decision criterion, growth optimality, which recommends choices that maximize long-run time-average growth given the operative growth dynamic (additive or multiplicative).",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        9,
        10
      ]
    },
    {
      "id": 4,
      "text": "EE uses generative stochastic processes and ergodic transformations, including geometric Brownian motion, multiplicative gambles, reallocating geometric Brownian motion, and logarithmic transformations, to model and convert non-ergodic observables into ergodic quantities for decision making.",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        11
      ]
    },
    {
      "id": 5,
      "text": "Samuelson introduced the ergodic axiom into economics in 1947, importing a closed-system simplification that can create the ergodic fallacy when applied to open economic systems with path dependence.",
      "role": "Context",
      "parents": [
        1
      ],
      "children": [
        6
      ]
    },
    {
      "id": 6,
      "text": "The ergodic fallacy is the false belief in stable relationships when ensemble and time averages differ, and it underlies many puzzles, paradoxes, and anomalies in finance and economics.",
      "role": "Claim",
      "parents": [
        1,
        5
      ],
      "children": [
        7
      ]
    },
    {
      "id": 7,
      "text": "An observable with multiplicative growth dynamics can have a positive ensemble mean but a negative time-average growth rate, so markets can show positive returns while most investors lose money due to high variance and winner-take-all effects.",
      "role": "Result",
      "parents": [
        2,
        6
      ],
      "children": [
        8,
        12
      ]
    },
    {
      "id": 8,
      "text": "EE links volatility (variance) of growth rates to disparities in outcomes: higher variance increases the gap between ensemble and time averages and produces winner-take-all dynamics and widespread time-average losses.",
      "role": "Claim",
      "parents": [
        2,
        7
      ],
      "children": [
        12
      ]
    },
    {
      "id": 9,
      "text": "Under additive growth dynamics (no bankruptcy, fixed periodic payments), growth-optimal strategies favor increased risky exposure because individual trajectories do not have absorbing zero outcomes.",
      "role": "Claim",
      "parents": [
        3
      ],
      "children": [
        13
      ]
    },
    {
      "id": 10,
      "text": "Under multiplicative growth dynamics (skin in the game, bankruptcy risk), growth-optimal strategies favor cautious exposure to risk because hitting zero is irreversible and severely reduces time-average growth.",
      "role": "Claim",
      "parents": [
        3
      ],
      "children": [
        13
      ]
    },
    {
      "id": 11,
      "text": "EE performs ergodic transformations, notably logarithmic transforms, to convert multiplicative return multipliers into additive growth rates, connecting EE to expected utility and enabling time-average based recommendations.",
      "role": "Method",
      "parents": [
        4
      ],
      "children": [
        3,
        12
      ]
    },
    {
      "id": 12,
      "text": "EE resolves traditional finance puzzles and paradoxes such as the St. Petersburg paradox, equity premium puzzle, cooperation paradox, inequality dynamics, and the insurance paradox by distinguishing ensemble and time averages and quantifying effects of variance.",
      "role": "Evidence",
      "parents": [
        6,
        7,
        11
      ],
      "children": [
        14
      ]
    },
    {
      "id": 13,
      "text": "Advisor-client mismatches of perceived growth dynamics cause misaligned recommendations: advisors using additive perspectives can over-encourage risk for multiplicative clients and vice versa.",
      "role": "Claim",
      "parents": [
        9,
        10
      ],
      "children": [
        14
      ]
    },
    {
      "id": 14,
      "text": "EE enables evidence-based, model-internal recommendations for asset allocation, product selection, and advisory best practices without relying on unconstrained psychological utility assumptions.",
      "role": "Conclusion",
      "parents": [
        3,
        11,
        12,
        13
      ],
      "children": [
        15
      ]
    },
    {
      "id": 15,
      "text": "Open questions and limitations remain, including identifying which financial contexts are additive versus multiplicative, determining behavioral confounds from unspecified growth dynamics, and empirically testing growth optimality across populations.",
      "role": "Limitation",
      "parents": [
        14
      ],
      "children": null
    }
  ]
}