{
  "nodes": [
    {
      "id": 0,
      "text": "Teacher test-score value-added (VA) measures capture teacher quality that causally affects students long-term adult outcomes (college attendance, earnings, teenage birth, neighborhood and retirement outcomes).",
      "role": "Hypothesis",
      "parents": null,
      "children": [
        1,
        2,
        3,
        4,
        5
      ]
    },
    {
      "id": 1,
      "text": "Linked administrative school records (grades 3-8, 1989-2009) and US federal tax records (1996-2011) for ~1.1 million students provide measures of teacher assignments, test-score VA, and adult outcomes (earnings, college attendance, 1098-T, zip code, 401(k), dependent claims).",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        6,
        7
      ]
    },
    {
      "id": 2,
      "text": "Two research designs estimate long-term impacts: (a) cross-classroom comparisons regressing adult outcomes on leave-year-out teacher VA controlling for prior scores and covariates (selection-on-observables), and (b) quasi-experimental teacher-turnover design regressing cohort-to-cohort changes in mean outcomes on changes in mean teacher VA within school-grade (teacher-switching as quasi-experiment).",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        6,
        8
      ]
    },
    {
      "id": 3,
      "text": "Assumption 1: leave-year-out test-score VA estimates are forecast unbiased (used to identify true teacher VA effect); Assumption 2: selection on observables (VA estimates orthogonal to unobserved determinants) for cross-class design; Assumption 3: within-school cohort changes in teacher VA are orthogonal to cohort changes in unobservables for quasi-experiment.",
      "role": "Assumption",
      "parents": [
        0
      ],
      "children": [
        2,
        6,
        8
      ]
    },
    {
      "id": 4,
      "text": "Control and implementation details: VA estimated using data excluding the focal year, outcomes residualized using within-teacher variation, class-level regressions with school-by-cohort clustering, trim top 1% VA outliers (possible test manipulation), adjust for drift and measurement error when interpreting VA.",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        6,
        9
      ]
    },
    {
      "id": 5,
      "text": "Limitations acknowledged: (i) VA captures only impacts correlated with test scores (lower bound for earnings VA), (ii) drift and estimation error reduce policy gains from selection, (iii) inability to fully identify structural net impacts holding all inputs fixed or complementarities across grades, (iv) possible behavioral responses (teaching to test, cheating) when VA used for evaluation.",
      "role": "Limitation",
      "parents": [
        0
      ],
      "children": null
    },
    {
      "id": 6,
      "text": "Cross-classroom (observational) estimates: a one standard deviation increase in teacher VA in a single grade raises college attendance at age 20 by ~0.82 percentage points, raises college quality at age 20 by ~$299, reduces teenage birth probability (females) by 0.61 pp, raises neighborhood college share by 0.25 pp, raises 401(k) participation by 0.55 pp, and raises annual earnings at age 28 by about 1.3–1.65% (~$350).",
      "role": "Result",
      "parents": [
        1,
        2,
        3,
        4
      ],
      "children": [
        10,
        9
      ]
    },
    {
      "id": 7,
      "text": "Data construction specifics and outcomes: matched sample covers 6.8 million student-subject-year observations (1.1 million students); W-2 earnings used (capped), 1098-T for college attendance, earnings-based college quality index constructed from population mean earnings at age 31; parental controls from 1040 linking.",
      "role": "Method",
      "parents": [
        1
      ],
      "children": [
        6,
        9
      ]
    },
    {
      "id": 8,
      "text": "Quasi-experimental teacher-turnover results: cohort-to-cohort changes in mean teacher VA within school-grade predict contemporaneous changes in college attendance and college quality; a one SD improvement in mean VA increases college attendance by ~0.86 pp and college quality by ~$198; placebo and timing tests support causal interpretation for college outcomes though earnings estimates lack precision in this design.",
      "role": "Result",
      "parents": [
        2,
        3,
        4
      ],
      "children": [
        10
      ]
    },
    {
      "id": 9,
      "text": "Earnings dynamics and interpretation: teacher VA effects on earnings grow with age in the 20s (negative initially due to college enrollment extensive margin), statistically significant positive earnings impacts by mid-20s and 1.34% used as baseline for lifetime PV calculations; reduced-form parameter kappa combines direct grade impact and indirect effects via endogenous responses (tracking), and is a lower bound for teachers' earnings VA.",
      "role": "Claim",
      "parents": [
        6,
        7,
        4
      ],
      "children": [
        11
      ]
    },
    {
      "id": 10,
      "text": "Heterogeneity: impacts slightly larger for females; English teacher VA has larger long-term effects per unit test-score gain than math (English test-score gains are harder to achieve but more predictive); impacts broadly similar across grades 4–8 (substantial returns beyond early childhood); higher absolute impacts for higher-income and non-minority students though percent effects are similar.",
      "role": "Result",
      "parents": [
        6,
        8
      ],
      "children": [
        11
      ]
    },
    {
      "id": 11,
      "text": "Tracking and net impacts: estimated tracking coefficients from current to future teachers are small in elementary school and larger in middle school; net impacts of a teacher holding future teacher quality fixed are modestly smaller (~20% on average) than reduced-form impacts, implying most reduced-form effects are direct teacher effects rather than tracking.",
      "role": "Claim",
      "parents": [
        9,
        10
      ],
      "children": [
        12
      ]
    },
    {
      "id": 12,
      "text": "Policy simulations: replacing teachers in bottom 5% of true VA with average teacher yields PV lifetime income gain ≈ $14,500 per student ($407,000 per classroom); using estimated VA (3 years of data) yields ~$185,000–$266,000 per class depending on horizon and drift; deselection policies produce large benefits relative to estimated compensation costs needed to offset evaluation risk, while retention bonuses for high-VA teachers are less cost-effective short-run.",
      "role": "Conclusion",
      "parents": [
        11,
        6
      ],
      "children": [
        13
      ]
    },
    {
      "id": 13,
      "text": "Overall conclusion: test-score based VA measures used in this setting are informative about teachers' long-term impacts and could be a useful input for personnel policy, but practical use must account for estimation noise, drift, possible strategic responses, and complement VA with other measures to optimize evaluation.",
      "role": "Conclusion",
      "parents": [
        12,
        5
      ],
      "children": null
    }
  ]
}