{
  "nodes": [
    {
      "id": 0,
      "text": "Economists' empirical estimates of economic damages from climate change systematically and severely underestimate true damages and therefore should not be used to assess climate risks or to guide policy.",
      "role": "Hypothesis",
      "parents": null,
      "children": [
        1,
        2,
        3,
        4,
        5
      ]
    },
    {
      "id": 1,
      "text": "A primary methodological flaw is neglecting climate tipping points and tipping cascades in damage assessments.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        6,
        8,
        14
      ]
    },
    {
      "id": 2,
      "text": "Many economists assume economic sectors that operate in 'controlled environments' (manufacturing, services, government) are insulated from climate impacts and therefore exclude them from damage calculations.",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        9,
        7
      ]
    },
    {
      "id": 3,
      "text": "The dominant methods used to estimate damages are: enumeration (sectoral summation), statistical spatial proxies (cross-sectional temperature-income fits), CGE models, and small expert elicitation exercises.",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        10,
        11,
        15
      ]
    },
    {
      "id": 4,
      "text": "The DICE integrated assessment model uses a simple quadratic damage function D(DeltaT)=a * DeltaT^2 with a very small a (e.g. a=0.00227), producing trivial aggregate damages (about 2.1% at 3 degrees C and 7.9% at 6 degrees C).",
      "role": "Result",
      "parents": [
        0
      ],
      "children": [
        12
      ]
    },
    {
      "id": 5,
      "text": "Because IAMs like DICE are calibrated to flawed empirical studies and use structural assumptions that exclude many pathways of damage, these models are inappropriate bases for policy (including social cost of carbon estimates).",
      "role": "Claim",
      "parents": [
        0
      ],
      "children": [
        13
      ]
    },
    {
      "id": 6,
      "text": "Scientific literature (Lenton et al. and follow-ups) identifies multiple tipping elements that could be triggered this century and can interact in cascades, contradicting claims that critical tipping elements are absent before 2100.",
      "role": "Evidence",
      "parents": [
        1
      ],
      "children": [
        8
      ]
    },
    {
      "id": 7,
      "text": "Three reasons indoor or 'controlled' sectors will be affected: (a) extreme events (fires, floods) damage infrastructure; (b) lethal wet-bulb temperatures can make workplaces uninhabitable; (c) climate affects availability and cost of essential environmental inputs (energy, agriculture, minerals).",
      "role": "Evidence",
      "parents": [
        2
      ],
      "children": null
    },
    {
      "id": 8,
      "text": "Including scientifically elicited tipping-point probabilities in DICE-style models dramatically increases damages and the social cost of carbon (e.g. more than eightfold in cited work).",
      "role": "Evidence",
      "parents": [
        1,
        6
      ],
      "children": null
    },
    {
      "id": 9,
      "text": "Nordhaus's enumeration assumption explicitly omitted sectors (manufacturing, trade, government) representing roughly 87% of US output by treating only weather-exposed sectors as vulnerable.",
      "role": "Evidence",
      "parents": [
        2
      ],
      "children": null
    },
    {
      "id": 10,
      "text": "The statistical spatial-proxy method fits current spatial temperature-income correlations (often weak, e.g. explaining ~10% of variation) and assumes those cross-sectional relationships apply over time to global warming, a premise that is physically and economically unjustified.",
      "role": "Evidence",
      "parents": [
        3
      ],
      "children": null
    },
    {
      "id": 11,
      "text": "CGE models used in the literature rely on partial-equilibrium damage inputs, assume market-driven adaptation to new equilibria, often ignore tipping points, and therefore tend to understate aggregate damages.",
      "role": "Evidence",
      "parents": [
        3
      ],
      "children": null
    },
    {
      "id": 12,
      "text": "A sensitivity analysis of DICE shows the model structurally prevents economic collapse: even with damage coefficients raised to produce damages >90% of GDP, the model yields corner solutions (full mitigation, extreme savings) and eventual recovery rather than systemic collapse, and becomes infeasible only beyond extreme parameter values.",
      "role": "Result",
      "parents": [
        4
      ],
      "children": [
        13
      ]
    },
    {
      "id": 13,
      "text": "Given the methodological errors, shared flawed data sources, and structural features of IAMs (notably DICE) that preclude collapse and downplay tipping risks, empirical estimates from this economic tradition and models calibrated to them should be rejected for evaluating climate risk and informing policy.",
      "role": "Conclusion",
      "parents": [
        5,
        12,
        8,
        10,
        11,
        9
      ],
      "children": null
    },
    {
      "id": 14,
      "text": "Nordhaus misrepresented Lenton et al.: he cited that no critical tipping elements have horizons under 300 years, whereas Lenton et al. warned several tipping elements could be triggered this century and emphasized potential near-term thresholds.",
      "role": "Evidence",
      "parents": [
        1
      ],
      "children": [
        6
      ]
    },
    {
      "id": 15,
      "text": "Nordhaus's small expert elicitation exhibited large disagreement: climate scientists in the survey expected damages an order(s) of magnitude larger than many economists, exposing deep epistemic divergence not resolved in subsequent literature.",
      "role": "Evidence",
      "parents": [
        3
      ],
      "children": null
    }
  ]
}