{
  "nodes": [
    {
      "id": 0,
      "text": "Economists' empirical estimates and integrated assessment models (notably DICE) severely underestimate damages from climate change and are unsuitable for evaluating climate risks or informing policy because they commit methodological errors and cannot generate economic collapse outcomes.",
      "role": "Hypothesis",
      "parents": null,
      "children": [
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        10
      ]
    },
    {
      "id": 1,
      "text": "Integrated Assessment Models (IAMs) map economic output to emissions, emissions to temperature, and temperature to economic damages via damage functions and have been influential in policy, with many IAMs calibrated to a small set of economic damage estimates.",
      "role": "Context",
      "parents": [
        0
      ],
      "children": [
        2,
        6
      ]
    },
    {
      "id": 2,
      "text": "The DICE model represents damages as a simple quadratic function of global temperature increase D(DeltaT) = a * DeltaT^2 with recent coefficient a about 0.00227, implying small GDP losses (e.g., 2.1% at 3C, 7.9% at 6C).",
      "role": "Method",
      "parents": [
        0,
        1
      ],
      "children": [
        3,
        9
      ]
    },
    {
      "id": 3,
      "text": "Scientific climate literature identifies multiple tipping elements likely triggerable this century (e.g., Arctic sea-ice, Greenland ice sheet) and tipping cascades that can produce abrupt, large, potentially irreversible changes amplifying damages.",
      "role": "Context",
      "parents": [
        0
      ],
      "children": [
        4,
        6
      ]
    },
    {
      "id": 4,
      "text": "Economists misrepresent or neglect tipping-point literature: Nordhaus and others asserted no critical tipping elements within 300 years or treated tipping as negligible, contradicting the original expert elicitation and later scientific work showing tipping risks at lower warming (around 2C) and cascade possibilities.",
      "role": "Claim",
      "parents": [
        0,
        3
      ],
      "children": [
        6,
        7
      ]
    },
    {
      "id": 5,
      "text": "Empirical methods used by economists to estimate damages include enumeration (sectoral summation assuming many sectors are 'negligibly affected'), cross-sectional statistical fits using spatial climate-income relationships, CGE models, and expert elicitation of mostly economists; these methods share key assumptions that downplay damages.",
      "role": "Method",
      "parents": [
        0
      ],
      "children": [
        6,
        8
      ]
    },
    {
      "id": 6,
      "text": "Key methodological errors identified: equating being indoors or 'not weather-exposed' with immunity to climate impacts; treating spatial correlations between current temperature and income as proxies for temporal climate change impacts; ignoring tipping points and systemic input dependencies.",
      "role": "Claim",
      "parents": [
        0,
        5,
        4
      ],
      "children": [
        7,
        8,
        9
      ]
    },
    {
      "id": 7,
      "text": "Evidence from climate science shows physical limits and non-linear effects (e.g., lethal wet-bulb thresholds, large reductions in habitable area, sea level rise, wildfires, AMOC risks) that imply much larger and potentially catastrophic economic impacts than those in the small quadratic damage calibrations.",
      "role": "Evidence",
      "parents": [
        3,
        6
      ],
      "children": [
        10
      ]
    },
    {
      "id": 8,
      "text": "Statistical and CGE approaches produce biased low damage estimates because spatial regression ignores historical adaptation, trade-mediated smoothing, and the different physics of regional vs global climate change; CGE also assumes market-driven adaptation to equilibrium which reduces partial-equilibrium damages.",
      "role": "Claim",
      "parents": [
        5,
        6
      ],
      "children": [
        10
      ]
    },
    {
      "id": 9,
      "text": "Sensitivity experiments on DICE increasing the damage coefficient and introducing stronger damage specifications show the model remains resilient: it enforces full mitigation or extreme corner solutions, reduces output and consumption dramatically but then recovers, and the model numerics fail only when damages exceed an extreme threshold; DICE cannot produce endogenous economic collapse.",
      "role": "Result",
      "parents": [
        2,
        6
      ],
      "children": [
        10
      ]
    },
    {
      "id": 10,
      "text": "Because IAMs like DICE are calibrated to flawed low-damage empirical estimates and structurally assume full employment, exogenous productivity and production functions that omit environmental inputs, they systematically understate risk and should not be used to set policy such as social cost of carbon.",
      "role": "Conclusion",
      "parents": [
        0,
        1,
        6,
        8,
        9,
        7
      ],
      "children": [
        11
      ]
    },
    {
      "id": 11,
      "text": "Recommendation: reject economists' empirical damage estimates that ignore tipping points and systemic dependencies, stop using models calibrated to them (e.g., DICE, FUND, PAGE) for evaluating climate risks or policy, and prioritize science-based approaches that incorporate tipping, environmental inputs, and non-equilibrium dynamics.",
      "role": "Conclusion",
      "parents": [
        10
      ],
      "children": null
    }
  ]
}